FILE='cwb2010-2017.csv'
x=read.csv(FILE,skip=0,header=F)
title=c("觀測時間","測站氣壓","海面氣壓",
        "測站最高氣壓","測站最高氣壓時間","測站最低氣壓",
        "測站最低氣壓時間","氣溫","最高氣溫","最高氣溫時間",
        "最低氣溫","最低氣溫時間","露點溫度","相對溼度",
        "最小相對溼度","最小相對溼度時間","風速","風向",
        "最大陣風","最大陣風風向","最大陣風風速時間",
        "降水量","降水時數","觀測10分鐘最大降水量",
        "觀測10分鐘最大降水起始時間","一小時最大降水量",
        "一小時最大降水量起始時間","日照時數","日照率",
        "全天空日射量","能見度","A型蒸發量")
names(x) = title;
data201001=x[grep("2010-01",x$測站最高氣壓時間),]
data201002=x[grep("2010-02",x$測站最高氣壓時間),]
data201007=x[grep("2010-07",x$測站最高氣壓時間),]
data201008=x[grep("2010-08",x$測站最高氣壓時間),]
data201009=x[grep("2010-09",x$測站最高氣壓時間),]
data201010=x[grep("2010-10",x$測站最高氣壓時間),]
plot(data201007$測站氣壓,type="b", pch=16, col="black",las=1,xlab="日期" ,ylab="大氣壓", main="2017/07", axes=TRUE)
plot(data201008$測站氣壓,type="b", pch=16, col="black",las=1,xlab="日期" ,ylab="大氣壓", main="2017/07", axes=TRUE)
plot(data201009$測站氣壓,type="b", pch=16, col="black",las=1,xlab="日期" ,ylab="大氣壓", main="2017/07", axes=TRUE)
plot(data201010$測站氣壓,type="b", pch=16, col="black",las=1,xlab="日期" ,ylab="大氣壓", main="2017/07", axes=TRUE)
